tutorials/BarschdorffNozzleLUSGS3/constant/thermophysicalProperties.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       sutherlandPolynomial;
    thermo          IAPWSIF97meta;
    equationOfState IAPWSIF97metaGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   18.21551552;
    }

    transport
    {
        As          1.823e-6;
        Ts          673.0;
        kappaCoeffs<4>  ( 7.341e-3 -1.013e-5 1.801e-7 -9.1e-11);
    }
}


// ************************************************************************* //
