tutorials/BarschdorffNozzleLUSGS3/0.orig/U.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U.2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type        codedFixedValue;
        value       uniform (0 0 0);
        name        mapFieldU2ToT1;
        code
        #{
            const volVectorField& sourceField = db().lookupObject<volVectorField>("U.1");
            operator== (sourceField.boundaryField()[patch().index()]);
        #};
    }
    
    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            slip;
    }
    
    emptyPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
