tutorials/BarschdorffNozzleLUSGS3/0.orig/T.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T.2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    inlet
    {
        type        codedFixedValue;
        value       uniform 350;
        name        mapFieldT1ToT2;
        code
        #{
            const volScalarField& sourceField = db().lookupObject<volScalarField>("T.1");
            operator== (sourceField.boundaryField()[patch().index()]);
        #};
    }

    outlet
    {
        type            zeroGradient;
    }
 
    wall
    {
        type            zeroGradient;
    }

    emptyPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
