tutorials/BarschdorffNozzleLUSGS3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(Q.*)"
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-9;
        relTol      1e-7;
        minIter     1;
    }

    "(Q.*)Final"
    {
        $U;
        relTol 0.0;
    }

    n
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-9;
        relTol      1e-7;
        minIter     1;
    }

    nFinal
    {
        $U;
        relTol 0.0;
    }
}

PIMPLE
{
    nOuterCorrectors    8;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    SIMPLErho           false;
    transonic           yes;
    consistent          yes;
    residualControl
    {
        n 
        {
            tolerance   1.e-5;
            relTol      1.e-4;
        }
    }
}

relaxationFactors
{
    equations
    {
        "(Q.*).*"       0.5;
	n       	0.5;
    }
}

LUSGS
{
    internalIterations 3;
    localTimestepping false;
    omega 2;
}

// ************************************************************************* //
